# 只要是浮点型参与的运算，返回的结果为浮点型
# print(1+1)


# / 除法运算，无论是否有浮点数参与，返回的结果始终是浮点类型
# print(10 / 2.0)


# print(10 * 2)
# 如果是字符串和数字相乘，字符串就会重复相应的次数
# print('%'*10)


# // 取整 是向下取整， 所得结果要比原结果要小
# print(10 / 3)  # 3.3333333333333335   3 4
# print(10 // 3)  # 3
# print(-10 / 3)  # -3.3333333333333335  临近-3和-4
# print(-10 // 3)  # -4


# print(10 % 3)


# ** 幂运算符
# print(2**3)  # 2*2*2
# print(3**3)  # 3*3*3


# print(1.1 + 2.2)
from decimal import Decimal
# 如果要计算的值是小数或者字符，就需要加上引号，整数不需要
print(Decimal('1.1')+Decimal('2.2'))
